Repository: politebarista/evenue
Catalog: lib/l10n/intl_*.arb
Languages: ru

# eventDetailsBuyTicketButton
source: Buy a ticket
ru: Купить билет

# eventDetailsTicketPurchaseUserNotAuthorizedErrorTitle
source: Authorization is required
ru: Необходима авторизация

# eventDetailsTicketPurchaseUserNotAuthorizedErrorDescription
source: To purchase a ticket, please log in or register first
ru: Для совершения покупки билета пожалуйста сначала авторизуйтесь или зарегистрируйтесь

# eventDetailsTicketPurchaseUserNotAuthorizedErrorButton
source: OK
ru: Ок

# enteringPurchaseDataCardNumberFieldLabel
source: Card number
ru: Номер карты

# enteringPurchaseDataCardNumberValidateError
source: Incorrect card number
ru: Неверный номер карты

# enteringPurchaseDataCardExpirationDateFieldLabel
source: Card expiration date
ru: Срок действия карты

# enteringPurchaseDataCardExpirationDateValidateError
source: Incorrect card expiration date
ru: Неверный срок действия карты

# enteringPurchaseDataCardExpirationDateFieldHint
source: MM/YY
ru: ММ/ГГ

# enteringPurchaseDataCardCVVValidateError
source: Incorrect CVV
ru: Неверный CVV

# enteringPurchaseDataCardHolderFieldLabel
source: Card holder name
ru: Имя держателя карты

# enteringPurchaseDataCardHolderValidateError
source: Incorrect card holder name
ru: Неверное имя держателя карты

# enteringPurchaseDataEmailValidateError
source: Incorrect Email
ru: Неверный Email

# enteringPurchaseDataContinueButton
source: Continue
ru: Продолжить

# enteringPurchaseDataErrorDialogTitle
source: Error
ru: Ошибка

# enteringPurchaseDataErrorDialogButton
source: OK
ru: Ок

# ticketPurchaseNoTicketsLeftForEventError
source: All tickets for this event were sold out
ru: Все билеты на это мероприятие были распроданы

# ticketPurchaseIncorrectPaymentCardInformationError
source: The bank card details are entered incorrectly. Please check them out
ru: Реквизиты банковской карты введены неверное. Пожалуйста проверьте их

# ticketPurchaseIncorrectEventInformationError
source: There is no such event. It may have been canceled
ru: Данного мероприятия нет. Возможно оно было отменено

# ticketPurchaseIncorrectCustomerInformationError
source: There is no user with this Email address. Please log in before purchasing
ru: Пользователя с таким Email нет. Пожалуйста авторизуйтесь перед покупкой

# ticketPurchaseUnknownError
source: An unexpected error occurred during the purchase of the ticket. Please try again later
ru: Во время покупки билета произошла непредвиденная ошибка. Пожалуйста попробуйте позже

# ticketPurchaseNoAwaitingPaymentTicketError
source: An error occurred during the purchase of the ticket. You may have spent more than 15 minutes entering the confirmation code. Please try again
ru: Во время покупки билета произошла ошибка. Возможно вы потратили на ввод кода подтверждение более 15 минут. Пожалуйста попробуйте ещё раз

# ticketPurchaseIncorrectConfirmationPurchaseCodeError
source: The confirmation code was entered incorrectly
ru: Код подтверждения покупки был введён неверно

# confirmPurchaseTitle
source: Confirmation of purchase
ru: Подтверждение покупки

# confirmPurchaseDescription
source: After entering the code and pressing on the "Confirm purchase" button, you will purchase tickets for the event "{eventName}"
ru: После ввода кода и нажатия на кнопку "Подтвердить покупку" вы приобретёте билеты на мероприятие "{eventName}"

# confirmPurchaseDescriptionWithoutEventName
source: After entering the code and pressing on the "Confirm purchase" button, you will purchase tickets for the event
ru: После ввода кода и нажатия на кнопку "Подтвердить покупку" вы приобретёте билеты на мероприятие

# confirmPurchaseConfirmationCodeFieldLabel
source: Confirmation code
ru: Код подтверждения

# confirmPurchaseIncorrectConfirmationCodeError
source: Check the correctness of the entered code
ru: Проверьте правильность введённого кода

# confirmPurchaseConfirmButton
source: Confirm the purchase
ru: Подтвердить покупку

# confirmPurchaseSuccessfullyPurchaseDialogTitle
source: The ticket has been purchased
ru: Билет приобретен

# confirmPurchaseSuccessfullyPurchaseDialogDescription
source: The ticket was successfully purchased. Thanks for the purchase
ru: Билет был успешно приобретен. Спасибо за покупку

# confirmPurchaseSuccessfullyPurchaseDialogButton
source: Ok
ru: Ок

# confirmPurchaseErrorDialogTitle
source: Oops.. Error
ru: Упс.. Ошибка

# confirmPurchaseErrorDialogButton
source: Ok
ru: Ок

# evenueDialogDefaultButton
source: Ok
ru: Ок
